void setup(){ 
  size(500,500);
}
int [][]go={  //0:沒有旗子、1:黑棋、2:白棋
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0},
};  ///陣列 array 9x9
int N=0;  //目前有幾個旗子
void mousePressed(){
  int j=(mouseX-25)/50;
  int i=(mouseY-25)/50;
  go[i][j]=(N%2==0) ? 1:2;  ///if(N%2==0)用1，否則2
  N++;
}
void draw(){
  background(246,194,108);  ///木頭色的棋盤
  for(int i=1;i<=9;i++){  ///畫線條
    line(50,50*i,450,50*i);
    line(50*i,50,50*i,450);
  }
  for(int i=0;i<9;i++){  ///左手i 對應y座標
    for(int j=0;j<9;j++){  ///右手j 對應x座標
      if(go[i][j]==1){  ///1:黑棋
        fill(0);
        ellipse(50+j*50,50+i*50,40,40);
      }
      else if(go[i][j]==2){  ///2:白棋
        fill(255);
        ellipse(50+j*50,50+i*50,40,40);
      }
    }
  }
}
